Revit 2027 API
MaterialNode.MaterialId Property
 The Id of the element assocated with this material in the model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MaterialId { get; }
Public ReadOnly Property MaterialId As ElementId
	Get
public:
property ElementId^ MaterialId {
	ElementId^ get ();
}
member MaterialId : ElementId with get
Property Value
ElementId
Remarks
 It is possible that no specific material is applied to a face, in which case the default material is used, and this property returns an InvalidElementId.
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace